In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns

银行流水记录bank_detail.txt。共5个字段，其中，第2个字段，时间戳为0表示时间未知；第3个字段，交易类型有两个值，1表示支出、0表示收入；第5个字段，工资收入标记为1时，表示工资收入。

In [2]:
# 银行流水记录表 bank_detail_train.txt
colmun_bank = ["user_id","time","loan_type","loan_amount","income"]
df_bank_train = pd.read_table(r"E:\datasets\rong360_loan\train\bank_detail_train.txt",sep=',',names=colmun_bank)
df_bank_train.head()

   user_id        time  loan_type  loan_amount  income
0     6965  5894316387          0    13.756664       0
1     6965  5894321388          1    13.756664       0
2     6965  5897553564          0    14.449810       0
3     6965  5897563463          1    10.527763       0
4     6965  5897564598          1    13.651303       0

In [3]:
# 信用卡账单记录bill_detail.txt
columns_bill = ['user_id','time','bank_id','last_bill_amount','last_repay_amount','credit_amount','cur_bill_bal','cur_bill_minrepay','cons_num','cur_bill_amount','adjust_amount','cyclic_accr','avail_bal','borrow_cash','repay_status']
df_bill_train = pd.read_table(r"E:\datasets\rong360_loan\train\bill_detail_train.txt",sep=',',names=columns_bill)
df_bill_train.head()

,user_id,time,bank_id,last_bill_amount,last_repay_amount,credit_amount,cur_bill_bal,cur_bill_minrepay,cons_num,cur_bill_amount,adjust_amount,cyclic_accr,avail_bal,borrow_cash,repay_status
0,3150,5906744363,6,18.626118,18.661937,20.664418,18.905766,17.847133,1,0.0,0.0,0.0,0.0,19.971271,0
1,3150,5906744401,6,18.905766,18.909954,20.664418,19.113305,17.911506,1,0.0,0.0,0.0,0.0,19.971271,0
2,3150,5906744427,6,19.113305,19.150290,20.664418,19.300194,17.977610,1,0.0,0.0,0.0,0.0,19.971271,0
3,3150,5906744515,6,19.300194,19.300280,21.000890,20.303240,18.477177,1,0.0,0.0,0.0,0.0,20.307743,0
4,3150,5906744562,6,20.303240,20.307744,21.000890,20.357134,18.510985,1,0.0,0.0,0.0,0.0,20.307743,0

In [4]:
# 用户浏览行为 browse_history.txt
columns_browse = ['user_id','time','brows_beh','brows_num']
df_browse_train = pd.read_table(r"E:\datasets\rong360_loan\train\browse_history_train.txt",sep=',',names=columns_browse)
df_browse_train.head()

   user_id        time  brows_beh  brows_num
0    34801  5926003545        173          1
1    34801  5926003545        164          4
2    34801  5926003545         38          7
3    34801  5926003545         45          1
4    34801  5926003545        110          7

In [5]:
# 放款时间信息loan_time.txt
columns_loanTime = ['user_id','time']
df_loanTime_train = pd.read_table(r"E:\datasets\rong360_loan\train\loan_time_train.txt",sep=',',names=columns_loanTime)
df_loanTime_train.head()

   user_id        time
0        1  5914855887
1        2  5914855887
2        3  5914855887
3        4  5914855887
4        5  5914855887

In [6]:
# 顾客是否发生逾期行为的记录overdue.txt
columns_overdue = ['user_id','overdue']
df_overdue_train = pd.read_table(r"E:\datasets\rong360_loan\train\overdue_train.txt",sep=',',names=columns_overdue)
df_overdue_train.head()

   user_id  overdue
0        1        0
1        2        0
2        3        0
3        4        1
4        5        0

In [7]:
# 用户基本属性表 user_info_train.txt
columns_userinfo = ['user_id','sex','job','eduction','marriage','residence']
df_userinfo_train = pd.read_table(r"E:\datasets\rong360_loan\train\user_info_train.txt",sep=',',names=columns_userinfo)
df_userinfo_train.head()

   user_id  sex  job  eduction  marriage  residence
0     3150    1    2         4         1          4
1     6965    1    2         4         3          2
2     1265    1    3         4         3          1
3     6360    1    2         4         3          2
4     2583    2    2         2         1          1

In [21]:
# 查看缺失值
print("df_bank_train:")
print(df_bank_train.isnull().sum())
print("*"*30)
print("df_bill_train:")
print(df_bill_train.isnull().sum())
print("*"*30)
print("df_browse_train:")
print(df_browse_train.isnull().sum())
print("*"*30)
print("df_loanTime_train:")
print(df_loanTime_train.isnull().sum())
print("*"*30)
print("df_overdue_train:")
print(df_overdue_train.isnull().sum())
print("*"*30)
print("df_userinfo_train:")
print(df_userinfo_train.isnull().sum())

df_bank_train:
user_id        0
time           0
loan_type      0
loan_amount    0
income         0
dtype: int64
******************************
df_bill_train:
user_id              0
time                 0
bank_id              0
last_bill_amount     0
last_repay_amount    0
credit_amount        0
cur_bill_bal         0
cur_bill_minrepay    0
cons_num             0
cur_bill_amount      0
adjust_amount        0
cyclic_accr          0
avail_bal            0
borrow_cash          0
repay_status         0
dtype: int64
******************************
df_browse_train:
user_id      0
time         0
brows_beh    0
brows_num    0
dtype: int64
******************************
df_loanTime_train:
user_id    0
time       0
dtype: int64
******************************
df_overdue_train:
user_id    0
overdue    0
dtype: int64
******************************
df_userinfo_train:
user_id      0
sex          0
job          0
eduction     0
marriage     0
residence    0
dtype: int64

In [13]:
# 查看数据集行列数
print("df_bank_train:" + str(df_bank_train.shape))
print("df_bill_train:" + str(df_bill_train.shape))
print("df_browse_train:" + str(df_browse_train.shape))
print("df_loanTime_train" + str(df_loanTime_train.shape))
print("df_overdue_train" + str(df_overdue_train.shape))
print("df_userinfo_train:" + str(df_userinfo_train.shape))

df_bank_train:(6070197, 5)
df_bill_train:(2338118, 15)
df_browse_train:(22919547, 4)
df_loanTime_train(55596, 2)
df_overdue_train(55596, 2)
df_userinfo_train:(55596, 6)

In [16]:
# 查看用户数
print("df_bank_train:" + str(len(df_bank_train.user_id.unique())))
print("df_bill_train:" + str(len(df_bill_train.user_id.unique())))
print("df_browse_train:" + str(len(df_browse_train.user_id.unique())))
print("df_loanTime_train:" + str(len(df_loanTime_train.user_id.unique())))
print("df_overdue_train:" + str(len(df_overdue_train.user_id.unique())))
print("df_userinfo_train:" + str(len(df_userinfo_train.user_id.unique())))

df_bank_train:9294
df_bill_train:53174
df_browse_train:47330
df_loanTime_train:55596
df_overdue_train:55596
df_userinfo_train:55596

In [30]:
# 筛选有银行流水的放款用户的用户id
df_bankId = pd.merge(df_bank_train,df_loanTime_train,how="left",on="user_id")

# 筛选出流水时间 < 放款时间的记录
df_bankId = df_bankId[(df_bankId["time_x"] <= df_bankId["time_y"])]

# 筛选出有银行流水且放款前的用户id并去重
bank_user = df_bankId[["user_id"]]
bank_user = bank_user.drop_duplicates(subset="user_id",keep='first')
bank_user.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9271 entries, 0 to 6069672
Data columns (total 1 columns):
user_id    9271 non-null int64
dtypes: int64(1)
memory usage: 144.9 KB

In [31]:
# 筛选出账单记录表的放款用户的用户id
df_billId = pd.merge(df_bill_train,df_loanTime_train,how="left",on="user_id")

# 筛选出流水时间 < 放款时间的记录
df_billId = df_billId[(df_billId["time_x"] <= df_billId["time_y"])]

# 筛选出有银行流水且放款前的用户id并去重
bill_user = df_billId[["user_id"]]
bill_user = bill_user.drop_duplicates(subset="user_id",keep='first')
bill_user.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 46739 entries, 0 to 2338115
Data columns (total 1 columns):
user_id    46739 non-null int64
dtypes: int64(1)
memory usage: 730.3 KB

In [33]:
# 筛选出用户浏览表的放款用户的用户id
df_browserId = pd.merge(df_browse_train,df_loanTime_train,how="left",on="user_id")

# 筛选出流水时间 < 放款时间的记录
df_browserId = df_browserId[(df_browserId["time_x"] <= df_browserId["time_y"])]

# 筛选出有浏览且放款前的用户id并去重
browser_user = df_browserId[["user_id"]]
browser_user = browser_user.drop_duplicates(subset="user_id",keep='first')
browser_user.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 44945 entries, 0 to 22919430
Data columns (total 1 columns):
user_id    44945 non-null int64
dtypes: int64(1)
memory usage: 702.3 KB

In [34]:
# 筛选出以上三张表中共有id
user = pd.merge(pd.merge(bank_user,bill_user,how="inner",on="user_id"),browser_user, how = "inner",on = "user_id")

In [35]:
user.info()
# 得出5735个用户的记录是完整的。然后通过这5735个id筛选每张表的记录，并进行字段预处理。

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5735 entries, 0 to 5734
Data columns (total 1 columns):
user_id    5735 non-null int64
dtypes: int64(1)
memory usage: 89.6 KB

#### (1)银行记录表
先筛选出id在‘user’中的记录，根据收入，支出以及工资这三个字段的交易类型进行筛选，并按id进行分组统计，每个分组中生成新的变量。

In [36]:
bank_slced = pd.merge(df_bank_train, user,how="inner",on="user_id")

In [41]:
bank_slced.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3865627 entries, 0 to 3865626
Data columns (total 5 columns):
user_id        int64
time           int64
loan_type      int64
loan_amount    float64
income         int64
dtypes: float64(1), int64(4)
memory usage: 177.0 MB

In [48]:
bank_slced["loan_amount"] = bank_slced["loan_amount"].map(lambda x:int(x))

In [49]:
bank_slced.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3865627 entries, 0 to 3865626
Data columns (total 5 columns):
user_id        int64
time           int64
loan_type      int64
loan_amount    int64
income         int64
dtypes: int64(5)
memory usage: 177.0 MB

In [53]:
b1 = bank_slced[(bank_slced['loan_type'] == 0)].groupby(['user_id'], as_index=False)  # 收入统计
b2 = bank_slced[(bank_slced['loan_type'] == 1)].groupby(['user_id'], as_index=False)  # 支出统计
b3 = bank_slced[(bank_slced['income'] == 1)].groupby(['user_id'], as_index=False)  # 工资收入统计

In [54]:
# loan_amount：交易金额
c1 = b1['loan_amount'].agg({'income_num': 'count', 'income_amount': 'sum'})  #三表共有用户在放款之前的收入次数和收入总额
c2 = b2['loan_amount'].agg({'expend_num': 'count', 'expend_amount': 'sum'})  #支出次数和支出额
c3 = b3['loan_amount'].agg({'wages_num' : 'count', 'wages_amount' : 'sum'})  #工资收入次数和工资收入额

In [62]:
c3.head()

   user_id  wages_num  wages_amount
0       67          7            82
1      117         17           137
2      119         17           240
3      178         14           200
4      189          7           103

In [60]:
b1.sum().head()

   user_id           time  loan_type  loan_amount  income
0        3   820019742693          0         2204       0
1        4   484040480334          0         1121       0
2       10   833642859267          0         1717       0
3       14  2720309258307          0         6632       0
4       16   206357701837          0          466       0